systems/junior_system.org
#+INCLUDE: bridgehtml.org

#+TITLE: 2/1 Bridge system

* Openings:
- 1!c :: 2+!c 12-22
- 1!d :: 4+!d 12-22
- 1!h :: 5+!h 12-22
- 1!s :: 5+!s 12-22
- 1NT :: balanced 15-17 includes 5M332
- 2!c :: strong: 22-23 balanced or any GF
- 2!d :: 6!d 5-10
- 2!h :: 6!h 5-10
- 2!s :: 6!s 5-10
- 2NT :: 20-21 balanced 

* Minor suit raise
*** Inverted minors
1!c-2!c and 1!d-2!d show an invitational or better raise without a 4 card or longer major. \\
Inverted minors continuations:
- New suits without jumps show stoppers, and are bid up the line. 
- Jumps to new suits show shortness. 
- Bidding NTs indicates that we think we have all suits stopped. 
Bidding 2NT or 3 of the opened minors are always not forcing. By responder it shows he only had an invitational raise, and by opener it shows he would not accept an invite. \\
\\
1m - 3m show a less than invitational raise and deny a side 4 card major. The hand should be strong enough to want to be in game opposite 18-19 balanced. 

* Major suit raises
*** Simples raise
1M-2M shows at least 3 card support and 5-10 points. \\
Opener can bid a new suit to show values in the bid suit and interest in game opposite a maximum (8-10 points) 

*** Mixed raise
1M-3M shows 4 card support, 6-9 points and not a flat hand (4333 or a 4432 with a two honors in the doubleton) 

*** Maas Raise
1M-2NT shows invitational or minimum GF(10-14 points) values 3 or more cards support. \\
Opener can bid 3M with a minimum to reject the invite or 4M if accepts the invite with no hope of slam. \\


*** 2/1 delayed raise
When partner opens a major and we have 14/15+ points and a fit we start by bidding a new suit. \\
\\
* Other responses to 1 level openings
- New suits at the 1 level show 4 or more cards and are forcing 1 round. 
- New suits at the 2 level without jumps show a GF hand two over one. 
- Single jumps to a new suit show 6+ cards in the bid suit and are invitational. They deny side 4 card majors and support for partner's suit
- Double jumps to new suits are splinters. 
- 1m - 1NT shows 5-10 points and no suit biddable at the 1 level 
- 1m - 2NT is invitation balanced without 4 card majors
- 1M-1NT shows 5-11 points without support for the opened majors, 1!h-1NT also denies 4 or more spades. 

* 1NT opening
- 2!c :: stayman
- 2!d :: 5+!h transfer
- 2!h :: 5+!s transfer
- 2!s :: 6+!c transfer
- 2NT :: 6+!d transfer


*** Stayman:
1NT - 2!c
- 2!d :: no 4 card majora
 - 2NT :: invitational
 - 3!h :: 4!h-5!s GF Smolen 
 - 3!s :: 4!s-5!h GF Smolen	
- 2!h :: 4!h could have 4!s
 - 2!s :: Invite with 4 spades
 - 2NT :: Invite without 4 spades
 - 3NT :: 4!s GF
- 2!s :: 4!s no 4!h

*** Transfers:
1NT - 2!h
- 2!s :: 2-3!s
 - 2NT :: 5!s invitational
 - 3!c :: 5!s - 4!c GF
 - 3ld :: 5!s - 4!d GF
 - 3!h :: 5!s - 5!h GF
 - 3!s :: 6!s invitational 
 - 3NT :: 5!s GF
- 2NT :: 4!s and a maximum 
- 3!s :: 4!s and a minimum

1NT - 2!s
- 2NT :: at least Hx in !c
 - 3!c :: to play
 - 3!d/M :: shortness
- 3!c :: no honor in !c
 - pass :: to play
 - 3!d/M :: shortness

* 2NT opening
- 3!c :: stayman
 - 3!d :: no major
  - 3!h 4!h-5!s Smolen
  - 3!s 4!s-5!h smolen
 - 3!h :: 4!h could have 4!s
  - 3NT 4!s GF
 - 3!s :: 4!s no 4!h
- 3!d :: 5+!h
- 3!h :: 5+!s
  
