systems/junior_system.html
<!DOCTYPE html>
<html lang="en">
<head>
<!-- 2026-03-27 Fri 07:34 -->
<meta charset="utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>2/1 Bidding system</title>
<meta name="generator" content="Org Mode" />
<meta http-equiv="X-UA-Compatible" content="IE=edge">
<meta name="viewport" content="width=device-width, initial-scale=1">
<link rel="stylesheet" type="text/css" href="bridgehtml.css">
<link rel="stylesheet" type="text/css" href="https://maxcdn.bootstrapcdn.com/font-awesome/4.5.0/css/font-awesome.min.css">
</head>
<body>
<div id="content" class="content">
<header>
<h1 class="title">2/1 Bidding system</h1>
</header><div id="outline-container-org7d777bf" class="outline-2">
<h2 id="org7d777bf">Openings:</h2>
<div class="outline-text-2" id="text-org7d777bf">
<dl class="org-dl">
<dt>1<span class="club">♣</span></dt><dd>2+<span class="club">♣</span> 12-22</dd>
<dt>1<span class="diamond">♦</span></dt><dd>4+<span class="diamond">♦</span> 12-22</dd>
<dt>1<span class="heart">♥</span></dt><dd>5+<span class="heart">♥</span> 12-22</dd>
<dt>1<span class="spade">♠</span></dt><dd>5+<span class="spade">♠</span> 12-22</dd>
<dt>1<span class="abbrev">nt</span></dt><dd>balanced 15-17 includes 5M332</dd>
<dt>2<span class="club">♣</span></dt><dd>strong: 22-23 balanced or any <span class="abbrev">gf</span></dd>
<dt>2<span class="diamond">♦</span></dt><dd>(5)6<span class="diamond">♦</span> 5-10</dd>
<dt>2<span class="heart">♥</span></dt><dd>(5)6<span class="heart">♥</span> 5-10</dd>
<dt>2<span class="spade">♠</span></dt><dd>(5)6<span class="spade">♠</span> 5-10</dd>
<dt>2<span class="abbrev">nt</span></dt><dd>20-21 balanced</dd>
</dl>
</div>
</div>
<div id="outline-container-orgeb95cb4" class="outline-2">
<h2 id="orgeb95cb4">Minor suit raise</h2>
<div class="outline-text-2" id="text-orgeb95cb4">
</div>
<div id="outline-container-org5964da6" class="outline-4">
<h4 id="org5964da6">Inverted minors</h4>
<div class="outline-text-4" id="text-org5964da6">
<p>
1<span class="club">♣</span>-2<span class="club">♣</span> and 1<span class="diamond">♦</span>-2<span class="diamond">♦</span> show an invitational or better raise without a 4 card or longer major. <br>
Inverted minors continuations:
</p>
<ul class="org-ul">
<li>New suits without jumps show stoppers, and are bid up the line.</li>
<li>Jumps to new suits show shortness.</li>
<li>Bidding NTs indicates that we think we have all suits stopped.</li>
</ul>
<p>
Bidding 2<span class="abbrev">nt</span> or 3 of the opened minors are always not forcing. By responder it shows he only had an invitational raise, and by opener it shows he would not accept an invite. <br>
<br>
1m - 3m show a less than invitational raise and deny a side 4 card major. The hand should be strong enough to want to be in game opposite 18-19 balanced. 
</p>
</div>
</div>
</div>
<div id="outline-container-org113c746" class="outline-2">
<h2 id="org113c746">Major suit raises</h2>
<div class="outline-text-2" id="text-org113c746">
</div>
<div id="outline-container-org0944c7e" class="outline-4">
<h4 id="org0944c7e">Simples raise</h4>
<div class="outline-text-4" id="text-org0944c7e">
<p>
1M-2M shows at least 3 card support and 5-10 points. <br>
Opener can bid a new suit to show values in the bid suit and interest in game opposite a maximum (8-10 points) 
</p>
</div>
</div>
<div id="outline-container-orgc03c5ec" class="outline-4">
<h4 id="orgc03c5ec">Mixed raise</h4>
<div class="outline-text-4" id="text-orgc03c5ec">
<p>
1M-3M shows 4 card support, 6-9 points and not a flat hand (4333 or a 4432 with a two honors in the doubleton) 
</p>
</div>
</div>
<div id="outline-container-orgbb92a50" class="outline-4">
<h4 id="orgbb92a50">Maas Raise</h4>
<div class="outline-text-4" id="text-orgbb92a50">
<p>
1M-2<span class="abbrev">nt</span> shows invitational or minimum <span class="abbrev">gf</span>(10-14 points) values 3 or more cards support. <br>
Opener can bid 3M with a minimum to reject the invite or 4M if accepts the invite with no hope of slam. <br>
</p>
</div>
</div>
<div id="outline-container-org175ff7b" class="outline-4">
<h4 id="org175ff7b">2/1 delayed raise</h4>
<div class="outline-text-4" id="text-org175ff7b">
<p>
When partner opens a major and we have 14/15+ points and a fit we start by bidding a new suit. <br>
<br>
</p>
</div>
</div>
</div>
<div id="outline-container-org5c97760" class="outline-2">
<h2 id="org5c97760">Other responses to 1 level openings</h2>
<div class="outline-text-2" id="text-org5c97760">
<ul class="org-ul">
<li>New suits at the 1 level show 4 or more cards and are forcing 1 round.</li>
<li>New suits at the 2 level without jumps show a <span class="abbrev">gf</span> hand two over one.</li>
<li>Single jumps to a new suit show 6+ cards in the bid suit and are invitational. They deny side 4 card majors and support for partner's suit</li>
<li>Double jumps to new suits are splinters.</li>
<li>1m - 1<span class="abbrev">nt</span> shows 5-10 points and no suit biddable at the 1 level</li>
<li>1m - 2<span class="abbrev">nt</span> is invitation balanced without 4 card majors</li>
<li>1M-1<span class="abbrev">nt</span> shows 5-11 points without support for the opened majors, 1<span class="heart">♥</span>-1<span class="abbrev">nt</span> also denies 4 or more spades.</li>
</ul>
</div>
</div>
<div id="outline-container-orgeaae291" class="outline-2">
<h2 id="orgeaae291">1<span class="abbrev">nt</span> opening</h2>
<div class="outline-text-2" id="text-orgeaae291">
<dl class="org-dl">
<dt>2<span class="club">♣</span></dt><dd>stayman</dd>
<dt>2<span class="diamond">♦</span></dt><dd>5+<span class="heart">♥</span> transfer</dd>
<dt>2<span class="heart">♥</span></dt><dd>5+<span class="spade">♠</span> transfer</dd>
<dt>2<span class="spade">♠</span></dt><dd>6+<span class="club">♣</span> transfer</dd>
<dt>2<span class="abbrev">nt</span></dt><dd>6+<span class="diamond">♦</span> transfer</dd>
</dl>
</div>
<div id="outline-container-org0d5ba9d" class="outline-4">
<h4 id="org0d5ba9d">Stayman:</h4>
<div class="outline-text-4" id="text-org0d5ba9d">
<p>
1<span class="abbrev">nt</span> - 2<span class="club">♣</span>
</p>
<dl class="org-dl">
<dt>2<span class="diamond">♦</span></dt><dd>no 4 card majora
<dl class="org-dl">
<dt>2<span class="abbrev">nt</span></dt><dd>invitational</dd>
<dt>3<span class="heart">♥</span></dt><dd>4<span class="heart">♥</span>-5<span class="spade">♠</span> <span class="abbrev">gf</span> Smolen</dd>
<dt>3<span class="spade">♠</span></dt><dd>4<span class="spade">♠</span>-5<span class="heart">♥</span> <span class="abbrev">gf</span> Smolen</dd>
</dl></dd>
<dt>2<span class="heart">♥</span></dt><dd>4<span class="heart">♥</span> could have 4<span class="spade">♠</span>
<dl class="org-dl">
<dt>2<span class="spade">♠</span></dt><dd>Invite with 4 spades</dd>
<dt>2<span class="abbrev">nt</span></dt><dd>Invite without 4 spades</dd>
<dt>3<span class="abbrev">nt</span></dt><dd>4<span class="spade">♠</span> <span class="abbrev">gf</span></dd>
</dl></dd>
<dt>2<span class="spade">♠</span></dt><dd>4<span class="spade">♠</span> no 4<span class="heart">♥</span></dd>
</dl>
</div>
</div>
<div id="outline-container-orgd3fc80c" class="outline-4">
<h4 id="orgd3fc80c">Transfers:</h4>
<div class="outline-text-4" id="text-orgd3fc80c">
<p>
1<span class="abbrev">nt</span> - 2<span class="heart">♥</span>
</p>
<dl class="org-dl">
<dt>2<span class="spade">♠</span></dt><dd>2-3<span class="spade">♠</span>
<dl class="org-dl">
<dt>2<span class="abbrev">nt</span></dt><dd>5<span class="spade">♠</span> invitational</dd>
<dt>3<span class="club">♣</span></dt><dd>5<span class="spade">♠</span> - 4<span class="club">♣</span> <span class="abbrev">gf</span></dd>
<dt>3ld</dt><dd>5<span class="spade">♠</span> - 4<span class="diamond">♦</span> <span class="abbrev">gf</span></dd>
<dt>3<span class="heart">♥</span></dt><dd>5<span class="spade">♠</span> - 5<span class="heart">♥</span> <span class="abbrev">gf</span></dd>
<dt>3<span class="spade">♠</span></dt><dd>6<span class="spade">♠</span> invitational</dd>
<dt>3<span class="abbrev">nt</span></dt><dd>5<span class="spade">♠</span> <span class="abbrev">gf</span></dd>
</dl></dd>
<dt>2<span class="abbrev">nt</span></dt><dd>4<span class="spade">♠</span> and a maximum</dd>
<dt>3<span class="spade">♠</span></dt><dd>4<span class="spade">♠</span> and a minimum</dd>
</dl>

<p>
1<span class="abbrev">nt</span> - 2<span class="spade">♠</span>
</p>
<dl class="org-dl">
<dt>2<span class="abbrev">nt</span></dt><dd>at least Hx in <span class="club">♣</span>
<dl class="org-dl">
<dt>3<span class="club">♣</span></dt><dd>to play</dd>
<dt>3<span class="diamond">♦</span>/M</dt><dd>shortness</dd>
</dl></dd>
<dt>3<span class="club">♣</span></dt><dd>no honor in <span class="club">♣</span>
<dl class="org-dl">
<dt>pass</dt><dd>to play</dd>
<dt>3<span class="diamond">♦</span>/M</dt><dd>shortness</dd>
</dl></dd>
</dl>
</div>
</div>
</div>
