systems/junior_system.org
* 2!c Opening
- 2!d :: waiting
 - 2!h :: Kokish: 5+!h GF or 24+ balanced, forces 2!s
  - 2!s :: forced
   - 2NT 24+ balanced → system on
   - 3!c 5!h-4!c
   - 3!d 5!h-4!d
   - 3!h 6+!h
   - 3!s 5!h-4!s
 - 2!s :: 5+!s GF
  - 2NT :: Asking
    - 3!c 5!s-4!c
    - 3!d 5!s-4!d
    - 3!h 5!s-4!h
    - 3!s 6+!s
 - 2NT :: 22-23 balanced → system on
 - 3!c :: 5+!c GF
  - 3!d :: Asking
   - 3!h 5!c - 4!h
   - 3!s 5!c - 4!s
   - 3NT no 4 card majors
 - 3!d :: 5+!d, no 4M GF
 - 3!h :: 5!d 4!h
 - 3!s :: 5!d 4!s
- 2M :: 5+M 8+ points
- 3m :: 6+m 8+ points

Bidding something different of the 2!d waiting bid over the 2 club opener usually takes a lot of bidding space and makes it very difficult to fully describe the hand by the opener. Therefore we must be careful if we skip the relay and make it only with hands with good suits. If our suit is not good enough we should just bid the relay. 

* Weak 2 openings continuations
- 3 level raise: preemptive raise with 3 card support
- 4 level raise: To play, preemptive or with values
- 2 level new suit: natural forcing 1 round
- 3 level new suit: natural GF
- Jump to new suits(below game): splinter with slam interest
- 2NT: feature ask

2x - 2NT feature ask
- 3x               minimum
- 3 new suit:  maximum with values in the bid suit
- 3NT:            maximum with no values in the side suits
- New suit 4rth level: Shortness on the bid suit

* Constructive bidding conventions
*** 2/1 auctions
1!h-2!d and 1!s-2!d are natural and GF promising 5 or more diamonds.\\
1!s-2!h similarly promises 5 or hearts and is GF\\
1!d-2!c, 1!h-2!c and 1!s-2!c are GF and could be natural or they could be from a balanced hand with no better bid.\\
\\
After a 2/1 response opener describes his hand naturally, but he can not bid above 2 of the opening suit unless he has 15+ points.\\
\\
Examples:\\
1!d - 2!c
- 2!d :: 6+!d or 4+!d 12-14 with no other bid
- 2!h :: 5+!d - 4!h 15+ (above 2 of the opening suit shows extras)
- 2!s :: 5+!d - 4!s 15+
- 2NT :: balanced 18-19 (could have 4 card majors)
- 3!c :: 5+!d-4+!c 15+
- 3!d :: solid diamond suit 15+

1!s - 2!d
- 2!h :: 5+!s - 4+!h 12-22
- 2!s :: 6+!s or 5!s 12-14 with no 4!h
 - 2NT :: waiting, usually balanced 15+
 - 3!c :: 5+!d - 4+!c slam interest or worried about a heart stop
 - 3!d :: 6+!d slam interest or very unbalanced
 - 3!h :: 5+!d - 4!h slam interest or worried about a club stop
 - 3!s :: 3+!s 14+, slam try
 - 3NT :: to play, could be from an unbalanced hand
- 2NT :: 18-19 balanced
- 3!c :: 5+!s-4+!c 15+
- 3!d :: 5+!s-3+!d 15+
- 3!s :: solid spade suit 15+

Because we play Maas raise over the 1M opening delayed support trough 2/1 shows a GF hand with at least 15 points, therefore partner should follow the slam try unless superminimum.\\

*** XYZ
After any 1x-1y-1x auctions like:\\
1!c - 1!h\\
1!s\\
\\
1!d-1!h\\
1NT\\
…\\
We play:\\
- 2!c :: forces 2!d\\

  a) A weak hand that wants to play 2!d or\\
  b) Any invitational hand

- 2!d :: ANY GF hands, asks partner to describe his hand
- 3!c :: to play

Exemple:\\
1!c - 1!s\\
1NT\\
- 2!c :: weak !d or any inv
 - 2!d :: forced
  - Pass :: weak with 5+!d
  - 2!h :: 5!s - 4!h inv
  - 2!s :: 5!s inv
  - 2NT :: 4!s inv
- 2!d :: any GF
  - 2!h :: 4!h could have 3!s
  - 2!s :: 3!s, no 4!h
  - 2NT :: no 3!s and no 4!h
- 3!c :: 5+!c - 4!s to play

*** Fourth suit GF
When opener bids a second suit at the 2 or higher level then bidding the remaining unbid suit by the responder is game forcing and asks for more information about the opener’s hand.\\
\\
1!h - 1!s\\
2!c -? \\
\\
1!d - 1!s\\
2!h -? \\
… \\
\\
Bidding the fourth suit (the last remaining unbid suit) is artificial and game forcing. It asks if opener has 3 card support for responder’s suit or a stopper in the fourth suit. \\
With no 3 card support nor a stopper in the fourth suit and no other descriptive bid to make opener can rebid his opening suit: waiting and showing no better bid. \\

