systems/junior_system.html
<div id="outline-container-orgac8f658" class="outline-2">
<h2 id="orgac8f658">2<span class="abbrev">nt</span> opening</h2>
<div class="outline-text-2" id="text-orgac8f658">
<dl class="org-dl">
<dt>3<span class="club">♣</span></dt><dd>stayman
<dl class="org-dl">
<dt>3<span class="diamond">♦</span></dt><dd>no major
<ul class="org-ul">
<li>3<span class="heart">♥</span> 4<span class="heart">♥</span>-5<span class="spade">♠</span> Smolen</li>
<li>3<span class="spade">♠</span> 4<span class="spade">♠</span>-5<span class="heart">♥</span> smolen</li>
</ul></dd>
<dt>3<span class="heart">♥</span></dt><dd>4<span class="heart">♥</span> could have 4<span class="spade">♠</span>
<ul class="org-ul">
<li>3<span class="abbrev">nt</span> 4<span class="spade">♠</span> <span class="abbrev">gf</span></li>
</ul></dd>
<dt>3<span class="spade">♠</span></dt><dd>4<span class="spade">♠</span> no 4<span class="heart">♥</span></dd>
</dl></dd>
<dt>3<span class="diamond">♦</span></dt><dd>5+<span class="heart">♥</span></dd>
<dt>3<span class="heart">♥</span></dt><dd>5+<span class="spade">♠</span></dd>
</dl>
</div>
</div>
<div id="outline-container-orgf404111" class="outline-2">
<h2 id="orgf404111">2<span class="club">♣</span> Opening</h2>
<div class="outline-text-2" id="text-orgf404111">
<dl class="org-dl">
<dt>2<span class="diamond">♦</span></dt><dd>waiting
<dl class="org-dl">
<dt>2<span class="heart">♥</span></dt><dd>Kokish: 5+<span class="heart">♥</span> <span class="abbrev">gf</span> or 24+ balanced, forces 2<span class="spade">♠</span>
<dl class="org-dl">
<dt>2<span class="spade">♠</span></dt><dd>forced
<ul class="org-ul">
<li>2<span class="abbrev">nt</span> 24+ balanced → system on</li>
<li>3<span class="club">♣</span> 5<span class="heart">♥</span>-4<span class="club">♣</span></li>
<li>3<span class="diamond">♦</span> 5<span class="heart">♥</span>-4<span class="diamond">♦</span></li>
<li>3<span class="heart">♥</span> 6+<span class="heart">♥</span></li>
<li>3<span class="spade">♠</span> 5<span class="heart">♥</span>-4<span class="spade">♠</span></li>
</ul></dd>
</dl></dd>
<dt>2<span class="spade">♠</span></dt><dd>5+<span class="spade">♠</span> <span class="abbrev">gf</span>
<dl class="org-dl">
<dt>2<span class="abbrev">nt</span></dt><dd>Asking
<ul class="org-ul">
<li>3<span class="club">♣</span> 5<span class="spade">♠</span>-4<span class="club">♣</span></li>
<li>3<span class="diamond">♦</span> 5<span class="spade">♠</span>-4<span class="diamond">♦</span></li>
<li>3<span class="heart">♥</span> 5<span class="spade">♠</span>-4<span class="heart">♥</span></li>
<li>3<span class="spade">♠</span> 6+<span class="spade">♠</span></li>
</ul></dd>
</dl></dd>
<dt>2<span class="abbrev">nt</span></dt><dd>22-23 balanced → system on</dd>
<dt>3<span class="club">♣</span></dt><dd>5+<span class="club">♣</span> <span class="abbrev">gf</span>
<dl class="org-dl">
<dt>3<span class="diamond">♦</span></dt><dd>Asking
<ul class="org-ul">
<li>3<span class="heart">♥</span> 5<span class="club">♣</span> - 4<span class="heart">♥</span></li>
<li>3<span class="spade">♠</span> 5<span class="club">♣</span> - 4<span class="spade">♠</span></li>
<li>3<span class="abbrev">nt</span> no 4 card majors</li>
</ul></dd>
</dl></dd>
<dt>3<span class="diamond">♦</span></dt><dd>5+<span class="diamond">♦</span>, no 4M <span class="abbrev">gf</span></dd>
<dt>3<span class="heart">♥</span></dt><dd>5<span class="diamond">♦</span> 4<span class="heart">♥</span></dd>
<dt>3<span class="spade">♠</span></dt><dd>5<span class="diamond">♦</span> 4<span class="spade">♠</span></dd>
</dl></dd>
<dt>2M</dt><dd>5+M 8+ points</dd>
<dt>3m</dt><dd>6+m 8+ points</dd>
</dl>

<p>
Bidding something different of the 2<span class="diamond">♦</span> waiting bid over the 2 club opener usually takes a lot of bidding space and makes it very difficult to fully describe the hand by the opener. Therefore we must be careful if we skip the relay and make it only with hands with good suits. If our suit is not good enough we should just bid the relay. 
</p>
</div>
</div>
<div id="outline-container-org237d7a3" class="outline-2">
<h2 id="org237d7a3">Weak 2 openings continuations</h2>
<div class="outline-text-2" id="text-org237d7a3">
<ul class="org-ul">
<li>3 level raise: preemptive raise with 3 card support</li>
<li>4 level raise: To play, preemptive or with values</li>
<li>2 level new suit: natural forcing 1 round</li>
<li>3 level new suit: natural <span class="abbrev">gf</span></li>
<li>Jump to new suits(below game): splinter with slam interest</li>
<li>2<span class="abbrev">nt</span>: feature ask</li>
</ul>

<p>
2x - 2<span class="abbrev">nt</span> feature ask
</p>
<ul class="org-ul">
<li>3x               minimum</li>
<li>3 new suit:  maximum with values in the bid suit</li>
<li>3<span class="abbrev">nt</span>:            maximum with no values in the side suits</li>
<li>New suit 4rth level: Shortness on the bid suit</li>
</ul>
</div>
</div>
<div id="outline-container-org7f3f7e9" class="outline-2">
<h2 id="org7f3f7e9">Constructive bidding conventions</h2>
<div class="outline-text-2" id="text-org7f3f7e9">
</div>
<div id="outline-container-org102c452" class="outline-4">
<h4 id="org102c452">2/1 auctions</h4>
<div class="outline-text-4" id="text-org102c452">
<p>
1<span class="heart">♥</span>-2<span class="diamond">♦</span> and 1<span class="spade">♠</span>-2<span class="diamond">♦</span> are natural and <span class="abbrev">gf</span> promising 5 or more diamonds.<br>
1<span class="spade">♠</span>-2<span class="heart">♥</span> similarly promises 5 or hearts and is <span class="abbrev">gf</span><br>
1<span class="diamond">♦</span>-2<span class="club">♣</span>, 1<span class="heart">♥</span>-2<span class="club">♣</span> and 1<span class="spade">♠</span>-2<span class="club">♣</span> are <span class="abbrev">gf</span> and could be natural or they could be from a balanced hand with no better bid.<br>
<br>
After a 2/1 response opener describes his hand naturally, but he can not bid above 2 of the opening suit unless he has 15+ points.<br>
<br>
Examples:<br>
1<span class="diamond">♦</span> - 2<span class="club">♣</span>
</p>
<dl class="org-dl">
<dt>2<span class="diamond">♦</span></dt><dd>6+<span class="diamond">♦</span> or 4+<span class="diamond">♦</span> 12-14 with no other bid</dd>
<dt>2<span class="heart">♥</span></dt><dd>5+<span class="diamond">♦</span> - 4<span class="heart">♥</span> 15+ (above 2 of the opening suit shows extras)</dd>
<dt>2<span class="spade">♠</span></dt><dd>5+<span class="diamond">♦</span> - 4<span class="spade">♠</span> 15+</dd>
<dt>2<span class="abbrev">nt</span></dt><dd>balanced 18-19 (could have 4 card majors)</dd>
<dt>3<span class="club">♣</span></dt><dd>5+<span class="diamond">♦</span>-4+<span class="club">♣</span> 15+</dd>
<dt>3<span class="diamond">♦</span></dt><dd>solid diamond suit 15+</dd>
</dl>

<p>
1<span class="spade">♠</span> - 2<span class="diamond">♦</span>
</p>
<dl class="org-dl">
<dt>2<span class="heart">♥</span></dt><dd>5+<span class="spade">♠</span> - 4+<span class="heart">♥</span> 12-22</dd>
<dt>2<span class="spade">♠</span></dt><dd>6+<span class="spade">♠</span> or 5<span class="spade">♠</span> 12-14 with no 4<span class="heart">♥</span>
<dl class="org-dl">
<dt>2<span class="abbrev">nt</span></dt><dd>waiting, usually balanced 15+</dd>
<dt>3<span class="club">♣</span></dt><dd>5+<span class="diamond">♦</span> - 4+<span class="club">♣</span> slam interest or worried about a heart stop</dd>
<dt>3<span class="diamond">♦</span></dt><dd>6+<span class="diamond">♦</span> slam interest or very unbalanced</dd>
<dt>3<span class="heart">♥</span></dt><dd>5+<span class="diamond">♦</span> - 4<span class="heart">♥</span> slam interest or worried about a club stop</dd>
<dt>3<span class="spade">♠</span></dt><dd>3+<span class="spade">♠</span> 14+, slam try</dd>
<dt>3<span class="abbrev">nt</span></dt><dd>to play, could be from an unbalanced hand</dd>
</dl></dd>
<dt>2<span class="abbrev">nt</span></dt><dd>18-19 balanced</dd>
<dt>3<span class="club">♣</span></dt><dd>5+<span class="spade">♠</span>-4+<span class="club">♣</span> 15+</dd>
<dt>3<span class="diamond">♦</span></dt><dd>5+<span class="spade">♠</span>-3+<span class="diamond">♦</span> 15+</dd>
<dt>3<span class="spade">♠</span></dt><dd>solid spade suit 15+</dd>
</dl>

<p>
Because we play Maas raise over the 1M opening delayed support trough 2/1 shows a <span class="abbrev">gf</span> hand with at least 15 points, therefore partner should follow the slam try unless superminimum.<br>
</p>
</div>
</div>
<div id="outline-container-org939145c" class="outline-4">
<h4 id="org939145c">XYZ</h4>
<div class="outline-text-4" id="text-org939145c">
<p>
After any 1x-1y-1x auctions like:<br>
1<span class="club">♣</span> - 1<span class="heart">♥</span><br>
1<span class="spade">♠</span><br>
<br>
1<span class="diamond">♦</span>-1<span class="heart">♥</span><br>
1<span class="abbrev">nt</span><br>
…<br>
We play:<br>
</p>
<dl class="org-dl">
<dt>2<span class="club">♣</span></dt><dd><p>
forces 2<span class="diamond">♦</span><br>
</p>

<p>
a) A weak hand that wants to play 2<span class="diamond">♦</span> or<br>
b) Any invitational hand
</p></dd>

<dt>2<span class="diamond">♦</span></dt><dd>ANY <span class="abbrev">gf</span> hands, asks partner to describe his hand</dd>
<dt>3<span class="club">♣</span></dt><dd>to play</dd>
</dl>

<p>
Exemple:<br>
1<span class="club">♣</span> - 1<span class="spade">♠</span><br>
1<span class="abbrev">nt</span><br>
</p>
<dl class="org-dl">
<dt>2<span class="club">♣</span></dt><dd>weak <span class="diamond">♦</span> or any inv
<dl class="org-dl">
<dt>2<span class="diamond">♦</span></dt><dd>forced
<dl class="org-dl">
<dt>Pass</dt><dd>weak with 5+<span class="diamond">♦</span></dd>
<dt>2<span class="heart">♥</span></dt><dd>5<span class="spade">♠</span> - 4<span class="heart">♥</span> inv</dd>
<dt>2<span class="spade">♠</span></dt><dd>5<span class="spade">♠</span> inv</dd>
<dt>2<span class="abbrev">nt</span></dt><dd>4<span class="spade">♠</span> inv</dd>
</dl></dd>
</dl></dd>
<dt>2<span class="diamond">♦</span></dt><dd>any <span class="abbrev">gf</span>
<dl class="org-dl">
<dt>2<span class="heart">♥</span></dt><dd>4<span class="heart">♥</span> could have 3<span class="spade">♠</span></dd>
<dt>2<span class="spade">♠</span></dt><dd>3<span class="spade">♠</span>, no 4<span class="heart">♥</span></dd>
<dt>2<span class="abbrev">nt</span></dt><dd>no 3<span class="spade">♠</span> and no 4<span class="heart">♥</span></dd>
</dl></dd>
<dt>3<span class="club">♣</span></dt><dd>5+<span class="club">♣</span> - 4<span class="spade">♠</span> to play</dd>
</dl>
</div>
</div>
<div id="outline-container-orgab5138d" class="outline-4">
<h4 id="orgab5138d">Fourth suit <span class="abbrev">gf</span></h4>
<div class="outline-text-4" id="text-orgab5138d">
<p>
When opener bids a second suit at the 2 or higher level then bidding the remaining unbid suit by the responder is game forcing and asks for more information about the opener’s hand.<br>
<br>
1<span class="heart">♥</span> - 1<span class="spade">♠</span><br>
2<span class="club">♣</span> -? <br>
<br>
1<span class="diamond">♦</span> - 1<span class="spade">♠</span><br>
2<span class="heart">♥</span> -? <br>
… <br>
<br>
Bidding the fourth suit (the last remaining unbid suit) is artificial and game forcing. It asks if opener has 3 card support for responder’s suit or a stopper in the fourth suit. <br>
With no 3 card support nor a stopper in the fourth suit and no other descriptive bid to make opener can rebid his opening suit: waiting and showing no better bid. <br>
</p>
</div>
</div>
