systems/junior_system.org
*** Third suit game forcing
After a 1 level opening and a ONE of a SUIT response and opener rebidding his opening suit at the 2 level:\\
1!c - 1!h\\
2!c\\
\\
1!h - 1!s\\
2!h\\
…\\
\\
Bidding without jumping one of the two remaining suits is game forcing. \\
The bids are natural in principle, but could be done on just a 2 or 3 card suit if worried about a stopper in the remaining unbid suit. The cheaper of the two bids could also be done without a real suit in order to set up a game forcing auction.\\
Exemple:\\
1!c - 1!s\\
2!c - ?
- 2!d :: 3 suit GF, it doesn’t promise diamonds
 - 2!h :: 5+!c - 4!h, no 3!s
 - 2!s :: 3!s
 - 2NT :: !h stopper, no 3!s
 - 3!c :: 6+!c, no 3!s, no good !h stop
 - 3!d :: 5+!c - 4!d
- 2!h :: 3 suit GF, usually 4+!h, could be just 3 looking for a !d stop
 - 2!s :: 3!s
 - 2NT :: !d stopper
 - 3!c :: 6+!c no !d stopper, no 3!s
*** Checkback

After 1m-1M-2NT :: 3!c is checkback and asks for 3 card support in the major or 4 cards in the other major:\\
1m - 1M\\
2NT - ?
- 3!c :: checkback
 - 3!d :: 3M AND 4oM
 - 3M :: 3M no 4oM
 - 3oM :: 4oM no 3M
 - 3NT :: no 3M nor 4oM
- 3M :: 6+M game forcing

*** Slam bidding
- 1430 RKCB
- Non serious 3NT
- Italian style cuebids

* Competitive bidding
*** We open and they overcall
If they double our 1 of a suit opening bid:
| ReDBL              | 11+ any distribution |
| 1 of a suit        | natural F1           |
| 1NT                | natural 8-10         |
| 2 of a suit        | natural NF (7-10)    |
| Jump support       | preemptive.          |
| Jump into new suit | preemptive.          |


If they overcall with 1NT\\
| DBL | 9+ points |
| 2 of a suit | natural to play |

If they overcall with a new suit\\
| DBL |  8+ points, TO and no other bid   |
| 1 of a suit | 8+ 4+suit F1  |
| 1NT | 8-10 with a stopper. No support or unbid 4 card major   |
| 2 of a suit(no jump) | 11+ 5+suit, forcing up to suit rebid   |
| 2 of opening suit | simple raise 5-10   |
| 3 of a suit(no jump) | GF 5+suit   | 
| Cuebid | support 11+   |
| Jump cuebid | GF support with shortness in opponents suit   |
| Jump support |  preemptive  |

*** Two suited overcalls
Unusual two no trumps:\\
(1x) - 2NT shows at least 5/5 in the lowest ranking unbid suits. \\
Micheal cuebid:\\
(1m) - 2m shows at least a 5/5 in the majors\\

(1M) - 2M shows at least 5 cards in the unbid major and 5 cards in one of the two minors. Partner can use 2NT(or 4NT) to ask which is the minor\\

*** After we overcall at the 1 or 2 level without jump
- New suits at the 1 level are forcing for 1 round
- New suits at the 2 level are not forcing but show a constructive or invitational hand
- New suits at the 3 level are GF both with and without a jump
- 1NT/2NT are both natural showing a stopper in the opponents’ suit. 1NT shows 8-11 points, 2NT after a 1 level overcall shows 12-14 points and 2NT after a 2 level overcall show 9-11 points. 
- Cuebidding opponents' suit without jump shows either an invitational or better support or a balanced hand with enough strength to play game but no stopper in opponents suit. 
- Jump cuebidding shows a mixed raise (4card support 6-9hcp and some distribution)

(1!c) - 1!h - (pass) - ? 
- 1!s :: 4+!s F1
- 1NT :: 8-11 with a !c stopper
- 2!c :: invitational or better support or 15+ points balanced with no !c stopper
- 2!d :: 5+!d 9-14 MF
- 2!h :: 3+!h 7-10
- 2NT :: 12-14 with a !c stopper
- 3!c :: mixed raise
- 3!d :: 5+!d GF


* UBH
The name is self explanatory
