systems/junior_system.html
<div id="outline-container-org2fc3a0a" class="outline-4">
<h4 id="org2fc3a0a">Third suit game forcing</h4>
<div class="outline-text-4" id="text-org2fc3a0a">
<p>
After a 1 level opening and a ONE of a SUIT response and opener rebidding his opening suit at the 2 level:<br>
1<span class="club">♣</span> - 1<span class="heart">♥</span><br>
2<span class="club">♣</span><br>
<br>
1<span class="heart">♥</span> - 1<span class="spade">♠</span><br>
2<span class="heart">♥</span><br>
…<br>
<br>
Bidding without jumping one of the two remaining suits is game forcing. <br>
The bids are natural in principle, but could be done on just a 2 or 3 card suit if worried about a stopper in the remaining unbid suit. The cheaper of the two bids could also be done without a real suit in order to set up a game forcing auction.<br>
Exemple:<br>
1<span class="club">♣</span> - 1<span class="spade">♠</span><br>
2<span class="club">♣</span> - ?
</p>
<dl class="org-dl">
<dt>2<span class="diamond">♦</span></dt><dd>3 suit <span class="abbrev">gf</span>, it doesn’t promise diamonds
<dl class="org-dl">
<dt>2<span class="heart">♥</span></dt><dd>5+<span class="club">♣</span> - 4<span class="heart">♥</span>, no 3<span class="spade">♠</span></dd>
<dt>2<span class="spade">♠</span></dt><dd>3<span class="spade">♠</span></dd>
<dt>2<span class="abbrev">nt</span></dt><dd><span class="heart">♥</span> stopper, no 3<span class="spade">♠</span></dd>
<dt>3<span class="club">♣</span></dt><dd>6+<span class="club">♣</span>, no 3<span class="spade">♠</span>, no good <span class="heart">♥</span> stop</dd>
<dt>3<span class="diamond">♦</span></dt><dd>5+<span class="club">♣</span> - 4<span class="diamond">♦</span></dd>
</dl></dd>
<dt>2<span class="heart">♥</span></dt><dd>3 suit <span class="abbrev">gf</span>, usually 4+<span class="heart">♥</span>, could be just 3 looking for a <span class="diamond">♦</span> stop
<dl class="org-dl">
<dt>2<span class="spade">♠</span></dt><dd>3<span class="spade">♠</span></dd>
<dt>2<span class="abbrev">nt</span></dt><dd><span class="diamond">♦</span> stopper</dd>
<dt>3<span class="club">♣</span></dt><dd>6+<span class="club">♣</span> no <span class="diamond">♦</span> stopper, no 3<span class="spade">♠</span></dd>
</dl></dd>
</dl>
</div>
</div>
<div id="outline-container-orgaceb6b4" class="outline-4">
<h4 id="orgaceb6b4">Checkback</h4>
<div class="outline-text-4" id="text-orgaceb6b4">
<p>
After 1m-1M-2<span class="abbrev">nt</span> :: 3<span class="club">♣</span> is checkback and asks for 3 card support in the major or 4 cards in the other major:<br>
1m - 1M<br>
2<span class="abbrev">nt</span> - ?
</p>
<dl class="org-dl">
<dt>3<span class="club">♣</span></dt><dd>checkback
<dl class="org-dl">
<dt>3<span class="diamond">♦</span></dt><dd>3M AND 4oM</dd>
<dt>3M</dt><dd>3M no 4oM</dd>
<dt>3oM</dt><dd>4oM no 3M</dd>
<dt>3<span class="abbrev">nt</span></dt><dd>no 3M nor 4oM</dd>
</dl></dd>
<dt>3M</dt><dd>6+M game forcing</dd>
</dl>
</div>
</div>
<div id="outline-container-org2b67eb1" class="outline-4">
<h4 id="org2b67eb1">Slam bidding</h4>
<div class="outline-text-4" id="text-org2b67eb1">
<ul class="org-ul">
<li>1430 RKCB</li>
<li>Non serious 3<span class="abbrev">nt</span></li>
<li>Italian style cuebids</li>
</ul>
</div>
</div>
</div>
<div id="outline-container-orgd8a05aa" class="outline-2">
<h2 id="orgd8a05aa">Competitive bidding</h2>
<div class="outline-text-2" id="text-orgd8a05aa">
</div>
<div id="outline-container-org424b69a" class="outline-4">
<h4 id="org424b69a">We open and they overcall</h4>
<div class="outline-text-4" id="text-org424b69a">
<p>
If they double our 1 of a suit opening bid:
</p>
<table>


<colgroup>
<col  class="org-left">

<col  class="org-left">
</colgroup>
<tbody>
<tr>
<td class="org-left">ReDBL</td>
<td class="org-left">11+ any distribution</td>
</tr>

<tr>
<td class="org-left">1 of a suit</td>
<td class="org-left">natural F1</td>
</tr>

<tr>
<td class="org-left">1<span class="abbrev">nt</span></td>
<td class="org-left">natural 8-10</td>
</tr>

<tr>
<td class="org-left">2 of a suit</td>
<td class="org-left">natural <span class="abbrev">nf</span> (7-10)</td>
</tr>

<tr>
<td class="org-left">Jump support</td>
<td class="org-left">preemptive.</td>
</tr>

<tr>
<td class="org-left">Jump into new suit</td>
<td class="org-left">preemptive.</td>
</tr>
</tbody>
</table>


<p>
If they overcall with 1<span class="abbrev">nt</span><br>
</p>
<table>


<colgroup>
<col  class="org-left">

<col  class="org-left">
</colgroup>
<tbody>
<tr>
<td class="org-left">DBL</td>
<td class="org-left">9+ points</td>
</tr>

<tr>
<td class="org-left">2 of a suit</td>
<td class="org-left">natural to play</td>
</tr>
</tbody>
</table>

<p>
If they overcall with a new suit<br>
</p>
<table>


<colgroup>
<col  class="org-left">

<col  class="org-left">
</colgroup>
<tbody>
<tr>
<td class="org-left">DBL</td>
<td class="org-left">8+ points, TO and no other bid</td>
</tr>

<tr>
<td class="org-left">1 of a suit</td>
<td class="org-left">8+ 4+suit F1</td>
</tr>

<tr>
<td class="org-left">1<span class="abbrev">nt</span></td>
<td class="org-left">8-10 with a stopper. No support or unbid 4 card major</td>
</tr>

<tr>
<td class="org-left">2 of a suit(no jump)</td>
<td class="org-left">11+ 5+suit, forcing up to suit rebid</td>
</tr>

<tr>
<td class="org-left">2 of opening suit</td>
<td class="org-left">simple raise 5-10</td>
</tr>

<tr>
<td class="org-left">3 of a suit(no jump)</td>
<td class="org-left"><span class="abbrev">gf</span> 5+suit</td>
</tr>

<tr>
<td class="org-left">Cuebid</td>
<td class="org-left">support 11+</td>
</tr>

<tr>
<td class="org-left">Jump cuebid</td>
<td class="org-left"><span class="abbrev">gf</span> support with shortness in opponents suit</td>
</tr>

<tr>
<td class="org-left">Jump support</td>
<td class="org-left">preemptive</td>
</tr>
</tbody>
</table>
</div>
</div>
<div id="outline-container-orgc9c4f5c" class="outline-4">
<h4 id="orgc9c4f5c">Two suited overcalls</h4>
<div class="outline-text-4" id="text-orgc9c4f5c">
<p>
Unusual two no trumps:<br>
(1x) - 2<span class="abbrev">nt</span> shows at least 5/5 in the lowest ranking unbid suits. <br>
Micheal cuebid:<br>
(1m) - 2m shows at least a 5/5 in the majors<br>
</p>

<p>
(1M) - 2M shows at least 5 cards in the unbid major and 5 cards in one of the two minors. Partner can use 2<span class="abbrev">nt</span>(or 4<span class="abbrev">nt</span>) to ask which is the minor<br>
</p>
</div>
</div>
<div id="outline-container-org3b13fb5" class="outline-4">
<h4 id="org3b13fb5">After we overcall at the 1 or 2 level without jump</h4>
<div class="outline-text-4" id="text-org3b13fb5">
<ul class="org-ul">
<li>New suits at the 1 level are forcing for 1 round</li>
<li>New suits at the 2 level are not forcing but show a constructive or invitational hand</li>
<li>New suits at the 3 level are <span class="abbrev">gf</span> both with and without a jump</li>
<li>1<span class="abbrev">nt</span>/2<span class="abbrev">nt</span> are both natural showing a stopper in the opponents’ suit. 1<span class="abbrev">nt</span> shows 8-11 points, 2<span class="abbrev">nt</span> after a 1 level overcall shows 12-14 points and 2<span class="abbrev">nt</span> after a 2 level overcall show 9-11 points.</li>
<li>Cuebidding opponents' suit without jump shows either an invitational or better support or a balanced hand with enough strength to play game but no stopper in opponents suit.</li>
<li>Jump cuebidding shows a mixed raise (4card support 6-9hcp and some distribution)</li>
</ul>

<p>
(1<span class="club">♣</span>) - 1<span class="heart">♥</span> - (pass) - ? 
</p>
<dl class="org-dl">
<dt>1<span class="spade">♠</span></dt><dd>4+<span class="spade">♠</span> F1</dd>
<dt>1<span class="abbrev">nt</span></dt><dd>8-11 with a <span class="club">♣</span> stopper</dd>
<dt>2<span class="club">♣</span></dt><dd>invitational or better support or 15+ points balanced with no <span class="club">♣</span> stopper</dd>
<dt>2<span class="diamond">♦</span></dt><dd>5+<span class="diamond">♦</span> 9-14 MF</dd>
<dt>2<span class="heart">♥</span></dt><dd>3+<span class="heart">♥</span> 7-10</dd>
<dt>2<span class="abbrev">nt</span></dt><dd>12-14 with a <span class="club">♣</span> stopper</dd>
<dt>3<span class="club">♣</span></dt><dd>mixed raise</dd>
<dt>3<span class="diamond">♦</span></dt><dd>5+<span class="diamond">♦</span> <span class="abbrev">gf</span></dd>
</dl>
</div>
</div>
</div>
<div id="outline-container-orgc93c596" class="outline-2">
<h2 id="orgc93c596">UBH</h2>
<div class="outline-text-2" id="text-orgc93c596">
<p>
The name is self explanatory
</p>
</div>
</div>
</div>
</body>
</html>
